TESTRUN1-HOST0-COMPR/fio-benchmark-output/Test07-Typewrite-BS1024k-DeviceCount07.txt
test1-subtest1-blocksize1024k-threads1-device1of7: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device2of7: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device3of7: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device4of7: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device5of7: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device6of7: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device7of7: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest2-blocksize1024k-threads2-device1of7: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device2of7: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device3of7: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device4of7: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device5of7: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device6of7: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device7of7: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device1of7: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device2of7: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device3of7: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device4of7: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device5of7: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device6of7: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device7of7: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device1of7: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device2of7: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device3of7: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device4of7: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device5of7: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device6of7: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device7of7: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device1of7: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device2of7: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device3of7: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device4of7: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device5of7: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device6of7: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device7of7: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device1of7: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device2of7: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device3of7: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device4of7: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device5of7: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device6of7: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device7of7: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device1of7: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device2of7: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device3of7: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device4of7: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device5of7: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device6of7: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device7of7: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device1of7: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device2of7: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device3of7: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device4of7: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device5of7: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device6of7: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device7of7: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device1of7: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device2of7: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device3of7: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device4of7: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device5of7: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device6of7: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device7of7: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device1of7: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device2of7: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device3of7: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device4of7: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device5of7: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device6of7: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device7of7: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
fio-3.12
Starting 385 processes

test1-subtest1-blocksize1024k-threads1-device1of7: (groupid=0, jobs=7): err= 0: pid=10655: Sat Jan 12 11:55:53 2019
  write: IOPS=3258, BW=3258MiB/s (3417MB/s)(191GiB/60002msec)
    slat (usec): min=18, max=113, avg=32.30, stdev= 5.19
    clat (usec): min=1248, max=56134, avg=2115.07, stdev=789.74
     lat (usec): min=1270, max=56155, avg=2147.44, stdev=789.87
    clat percentiles (usec):
     |  1.00th=[ 1352],  5.00th=[ 1434], 10.00th=[ 1500], 20.00th=[ 1582],
     | 30.00th=[ 1663], 40.00th=[ 1762], 50.00th=[ 1893], 60.00th=[ 2008],
     | 70.00th=[ 2212], 80.00th=[ 2540], 90.00th=[ 2999], 95.00th=[ 3589],
     | 99.00th=[ 4883], 99.50th=[ 5473], 99.90th=[ 7373], 99.95th=[ 8848],
     | 99.99th=[12125]
   bw (  MiB/s): min= 2990, max= 3487, per=99.70%, avg=3248.63, stdev=13.03, samples=833
   iops        : min= 2989, max= 3484, avg=3247.45, stdev=12.99, samples=833
  lat (msec)   : 2=59.48%, 4=37.42%, 10=3.07%, 20=0.03%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.76%, sys=0.90%, ctx=198613, majf=0, minf=118
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,195509,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest2-blocksize1024k-threads2-device1of7: (groupid=1, jobs=14): err= 0: pid=10992: Sat Jan 12 11:55:53 2019
  write: IOPS=5268, BW=5269MiB/s (5525MB/s)(309GiB/60003msec)
    slat (usec): min=17, max=127, avg=33.23, stdev= 5.75
    clat (usec): min=1284, max=73280, avg=2622.90, stdev=930.15
     lat (usec): min=1311, max=73309, avg=2656.21, stdev=930.46
    clat percentiles (usec):
     |  1.00th=[ 1565],  5.00th=[ 1663], 10.00th=[ 1762], 20.00th=[ 1926],
     | 30.00th=[ 2073], 40.00th=[ 2278], 50.00th=[ 2474], 60.00th=[ 2638],
     | 70.00th=[ 2868], 80.00th=[ 3163], 90.00th=[ 3589], 95.00th=[ 4293],
     | 99.00th=[ 5669], 99.50th=[ 6259], 99.90th=[ 8160], 99.95th=[ 9503],
     | 99.99th=[16188]
   bw (  MiB/s): min= 3870, max= 5545, per=88.58%, avg=4667.20, stdev=37.99, samples=1671
   iops        : min= 3868, max= 5543, avg=4663.69, stdev=38.02, samples=1671
  lat (msec)   : 2=25.70%, 4=67.80%, 10=6.45%, 20=0.03%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.66%, sys=0.72%, ctx=321945, majf=0, minf=233
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,316144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest3-blocksize1024k-threads3-device1of7: (groupid=2, jobs=21): err= 0: pid=11288: Sat Jan 12 11:55:53 2019
  write: IOPS=6051, BW=6052MiB/s (6346MB/s)(355GiB/60005msec)
    slat (usec): min=18, max=164, avg=38.40, stdev= 6.79
    clat (usec): min=1327, max=77551, avg=3430.55, stdev=1091.77
     lat (usec): min=1361, max=77595, avg=3469.03, stdev=1092.44
    clat percentiles (usec):
     |  1.00th=[ 1663],  5.00th=[ 1958], 10.00th=[ 2180], 20.00th=[ 2573],
     | 30.00th=[ 2868], 40.00th=[ 3097], 50.00th=[ 3359], 60.00th=[ 3621],
     | 70.00th=[ 3916], 80.00th=[ 4228], 90.00th=[ 4555], 95.00th=[ 5080],
     | 99.00th=[ 6390], 99.50th=[ 7046], 99.90th=[ 9896], 99.95th=[11731],
     | 99.99th=[15270]
   bw (  MiB/s): min= 4188, max= 6307, per=89.65%, avg=5425.10, stdev=23.93, samples=2508
   iops        : min= 4184, max= 6302, avg=5417.99, stdev=23.96, samples=2508
  lat (msec)   : 2=5.84%, 4=67.48%, 10=26.58%, 20=0.09%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.65%, sys=0.56%, ctx=371508, majf=0, minf=346
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,363124,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest4-blocksize1024k-threads4-device1of7: (groupid=3, jobs=28): err= 0: pid=11623: Sat Jan 12 11:55:53 2019
  write: IOPS=6242, BW=6243MiB/s (6546MB/s)(366GiB/60006msec)
    slat (usec): min=18, max=233, avg=50.80, stdev= 9.70
    clat (usec): min=1401, max=76472, avg=4432.93, stdev=1160.50
     lat (usec): min=1454, max=76525, avg=4483.81, stdev=1162.28
    clat percentiles (usec):
     |  1.00th=[ 2147],  5.00th=[ 2737], 10.00th=[ 3064], 20.00th=[ 3556],
     | 30.00th=[ 3916], 40.00th=[ 4146], 50.00th=[ 4359], 60.00th=[ 4621],
     | 70.00th=[ 4948], 80.00th=[ 5342], 90.00th=[ 5735], 95.00th=[ 6063],
     | 99.00th=[ 7111], 99.50th=[ 7767], 99.90th=[ 9634], 99.95th=[12387],
     | 99.99th=[19792]
   bw (  MiB/s): min= 4569, max= 6461, per=87.93%, avg=5489.28, stdev=16.32, samples=3344
   iops        : min= 4561, max= 6451, avg=5477.41, stdev=16.33, samples=3344
  lat (msec)   : 2=0.60%, 4=32.43%, 10=66.88%, 20=0.08%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.78%, sys=0.45%, ctx=386506, majf=0, minf=461
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,374606,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest5-blocksize1024k-threads5-device1of7: (groupid=4, jobs=35): err= 0: pid=11889: Sat Jan 12 11:55:53 2019
  write: IOPS=6274, BW=6275MiB/s (6580MB/s)(368GiB/60007msec)
    slat (usec): min=18, max=291, avg=38.06, stdev=11.38
    clat (usec): min=1419, max=88446, avg=5538.32, stdev=1328.74
     lat (usec): min=1449, max=88495, avg=5576.46, stdev=1329.67
    clat percentiles (usec):
     |  1.00th=[ 3163],  5.00th=[ 3556], 10.00th=[ 4015], 20.00th=[ 4555],
     | 30.00th=[ 4817], 40.00th=[ 5080], 50.00th=[ 5407], 60.00th=[ 5735],
     | 70.00th=[ 6259], 80.00th=[ 6718], 90.00th=[ 7046], 95.00th=[ 7373],
     | 99.00th=[ 8455], 99.50th=[ 9110], 99.90th=[11863], 99.95th=[13829],
     | 99.99th=[28181]
   bw (  MiB/s): min= 4167, max= 6397, per=79.26%, avg=4973.26, stdev=15.34, samples=4175
   iops        : min= 4153, max= 6386, avg=4958.36, stdev=15.36, samples=4175
  lat (msec)   : 2=0.02%, 4=9.72%, 10=90.04%, 20=0.20%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.41%, sys=0.33%, ctx=385700, majf=0, minf=577
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,376536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest6-blocksize1024k-threads6-device1of7: (groupid=5, jobs=42): err= 0: pid=12255: Sat Jan 12 11:55:53 2019
  write: IOPS=6275, BW=6275MiB/s (6580MB/s)(368GiB/60007msec)
    slat (usec): min=18, max=205, avg=38.47, stdev= 8.81
    clat (usec): min=1549, max=90994, avg=6652.85, stdev=1523.79
     lat (usec): min=1587, max=91028, avg=6691.41, stdev=1525.55
    clat percentiles (usec):
     |  1.00th=[ 3949],  5.00th=[ 4490], 10.00th=[ 4817], 20.00th=[ 5473],
     | 30.00th=[ 5866], 40.00th=[ 6259], 50.00th=[ 6652], 60.00th=[ 6980],
     | 70.00th=[ 7242], 80.00th=[ 7635], 90.00th=[ 8455], 95.00th=[ 9110],
     | 99.00th=[10159], 99.50th=[10683], 99.90th=[13698], 99.95th=[15664],
     | 99.99th=[34866]
   bw (  MiB/s): min= 4350, max= 6395, per=80.55%, avg=5054.74, stdev=10.38, samples=5014
   iops        : min= 4334, max= 6376, avg=5034.16, stdev=10.40, samples=5014
  lat (msec)   : 2=0.01%, 4=1.16%, 10=97.34%, 20=1.48%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.36%, sys=0.27%, ctx=383889, majf=0, minf=697
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,376571,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest7-blocksize1024k-threads7-device1of7: (groupid=6, jobs=49): err= 0: pid=12603: Sat Jan 12 11:55:53 2019
  write: IOPS=6279, BW=6279MiB/s (6584MB/s)(368GiB/60010msec)
    slat (usec): min=18, max=167, avg=43.49, stdev=10.91
    clat (usec): min=1568, max=89949, avg=7758.10, stdev=1682.51
     lat (usec): min=1600, max=89997, avg=7801.67, stdev=1684.37
    clat percentiles (usec):
     |  1.00th=[ 4555],  5.00th=[ 5342], 10.00th=[ 5866], 20.00th=[ 6521],
     | 30.00th=[ 6849], 40.00th=[ 7046], 50.00th=[ 7373], 60.00th=[ 7898],
     | 70.00th=[ 8586], 80.00th=[ 9372], 90.00th=[10159], 95.00th=[10421],
     | 99.00th=[10945], 99.50th=[11600], 99.90th=[14484], 99.95th=[17171],
     | 99.99th=[26084]
   bw (  MiB/s): min= 3924, max= 6375, per=77.13%, avg=4843.20, stdev= 7.90, samples=5844
   iops        : min= 3906, max= 6357, avg=4822.53, stdev= 7.91, samples=5844
  lat (msec)   : 2=0.01%, 4=0.13%, 10=87.37%, 20=12.47%, 50=0.02%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.37%, sys=0.24%, ctx=385949, majf=0, minf=808
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,376818,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest8-blocksize1024k-threads8-device1of7: (groupid=7, jobs=56): err= 0: pid=12911: Sat Jan 12 11:55:53 2019
  write: IOPS=6281, BW=6282MiB/s (6587MB/s)(368GiB/60010msec)
    slat (usec): min=18, max=261, avg=49.56, stdev=12.05
    clat (usec): min=1403, max=90466, avg=8863.11, stdev=1697.29
     lat (usec): min=1441, max=90498, avg=8912.75, stdev=1699.03
    clat percentiles (usec):
     |  1.00th=[ 5669],  5.00th=[ 6521], 10.00th=[ 6915], 20.00th=[ 7177],
     | 30.00th=[ 7504], 40.00th=[ 8160], 50.00th=[ 8979], 60.00th=[ 9503],
     | 70.00th=[10290], 80.00th=[10552], 90.00th=[10683], 95.00th=[10945],
     | 99.00th=[11994], 99.50th=[12518], 99.90th=[15533], 99.95th=[17433],
     | 99.99th=[25297]
   bw (  MiB/s): min= 4093, max= 6384, per=77.17%, avg=4847.80, stdev= 8.25, samples=6680
   iops        : min= 4071, max= 6359, avg=4822.08, stdev= 8.27, samples=6680
  lat (msec)   : 2=0.01%, 4=0.03%, 10=64.91%, 20=35.03%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.39%, sys=0.20%, ctx=387339, majf=0, minf=931
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,376972,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest9-blocksize1024k-threads9-device1of7: (groupid=8, jobs=63): err= 0: pid=13299: Sat Jan 12 11:55:53 2019
  write: IOPS=6282, BW=6283MiB/s (6588MB/s)(368GiB/60011msec)
    slat (usec): min=20, max=331, avg=54.28, stdev=11.62
    clat (usec): min=1538, max=93499, avg=9971.27, stdev=1927.34
     lat (usec): min=1597, max=93552, avg=10025.64, stdev=1929.00
    clat percentiles (usec):
     |  1.00th=[ 6128],  5.00th=[ 6980], 10.00th=[ 7373], 20.00th=[ 8160],
     | 30.00th=[ 8848], 40.00th=[ 9503], 50.00th=[10159], 60.00th=[10683],
     | 70.00th=[10945], 80.00th=[11469], 90.00th=[12387], 95.00th=[13042],
     | 99.00th=[13829], 99.50th=[14091], 99.90th=[17171], 99.95th=[19268],
     | 99.99th=[24773]
   bw (  MiB/s): min= 3951, max= 6326, per=72.59%, avg=4560.63, stdev= 6.35, samples=7511
   iops        : min= 3924, max= 6295, avg=4530.58, stdev= 6.37, samples=7511
  lat (msec)   : 2=0.01%, 4=0.03%, 10=46.04%, 20=53.89%, 50=0.03%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.39%, sys=0.19%, ctx=387017, majf=0, minf=990
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,377022,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest10-blocksize1024k-threads10-device1of7: (groupid=9, jobs=70): err= 0: pid=13624: Sat Jan 12 11:55:53 2019
  write: IOPS=6283, BW=6284MiB/s (6589MB/s)(368GiB/60013msec)
    slat (usec): min=20, max=315, avg=59.31, stdev=13.15
    clat (usec): min=1555, max=95559, avg=11077.87, stdev=2103.65
     lat (usec): min=1584, max=95618, avg=11137.27, stdev=2106.18
    clat percentiles (usec):
     |  1.00th=[ 6718],  5.00th=[ 7767], 10.00th=[ 8455], 20.00th=[ 9241],
     | 30.00th=[10028], 40.00th=[10421], 50.00th=[10683], 60.00th=[11469],
     | 70.00th=[12387], 80.00th=[13304], 90.00th=[13829], 95.00th=[14091],
     | 99.00th=[14484], 99.50th=[15008], 99.90th=[18744], 99.95th=[21103],
     | 99.99th=[29754]
   bw (  MiB/s): min= 5868, max= 6635, per=99.99%, avg=6283.33, stdev= 1.94, samples=8378
   iops        : min= 5859, max= 6635, avg=6280.12, stdev= 1.95, samples=8378
  lat (msec)   : 2=0.01%, 4=0.02%, 10=28.45%, 20=71.46%, 50=0.06%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.39%, sys=0.18%, ctx=388283, majf=0, minf=1100
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,377103,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3258MiB/s (3417MB/s), 3258MiB/s-3258MiB/s (3417MB/s-3417MB/s), io=191GiB (205GB), run=60002-60002msec

Run status group 1 (all jobs):
  WRITE: bw=5269MiB/s (5525MB/s), 5269MiB/s-5269MiB/s (5525MB/s-5525MB/s), io=309GiB (332GB), run=60003-60003msec

Run status group 2 (all jobs):
  WRITE: bw=6052MiB/s (6346MB/s), 6052MiB/s-6052MiB/s (6346MB/s-6346MB/s), io=355GiB (381GB), run=60005-60005msec

Run status group 3 (all jobs):
  WRITE: bw=6243MiB/s (6546MB/s), 6243MiB/s-6243MiB/s (6546MB/s-6546MB/s), io=366GiB (393GB), run=60006-60006msec

Run status group 4 (all jobs):
  WRITE: bw=6275MiB/s (6580MB/s), 6275MiB/s-6275MiB/s (6580MB/s-6580MB/s), io=368GiB (395GB), run=60007-60007msec

Run status group 5 (all jobs):
  WRITE: bw=6275MiB/s (6580MB/s), 6275MiB/s-6275MiB/s (6580MB/s-6580MB/s), io=368GiB (395GB), run=60007-60007msec

Run status group 6 (all jobs):
  WRITE: bw=6279MiB/s (6584MB/s), 6279MiB/s-6279MiB/s (6584MB/s-6584MB/s), io=368GiB (395GB), run=60010-60010msec

Run status group 7 (all jobs):
  WRITE: bw=6282MiB/s (6587MB/s), 6282MiB/s-6282MiB/s (6587MB/s-6587MB/s), io=368GiB (395GB), run=60010-60010msec

Run status group 8 (all jobs):
  WRITE: bw=6283MiB/s (6588MB/s), 6283MiB/s-6283MiB/s (6588MB/s-6588MB/s), io=368GiB (395GB), run=60011-60011msec

Run status group 9 (all jobs):
  WRITE: bw=6284MiB/s (6589MB/s), 6284MiB/s-6284MiB/s (6589MB/s-6589MB/s), io=368GiB (395GB), run=60013-60013msec

Disk stats (read/write):
    dm-21: ios=358/482083, merge=0/0, ticks=268/3552623, in_queue=3552946, util=99.42%, aggrios=99/120525, aggrmerge=0/0, aggrticks=72/886860, aggrin_queue=886491, aggrutil=93.95%
  sddk: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcd: ios=198/241051, merge=0/0, ticks=155/1768074, in_queue=1767365, util=93.92%
  sdaw: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdp: ios=200/241049, merge=0/0, ticks=136/1779366, in_queue=1778600, util=93.95%
    dm-22: ios=359/624131, merge=0/0, ticks=250/3548550, in_queue=3548792, util=99.43%, aggrios=99/156036, aggrmerge=0/0, aggrticks=64/885474, aggrin_queue=885021, aggrutil=93.88%
  sdbb: ios=201/312071, merge=0/0, ticks=131/1775854, in_queue=1774943, util=93.84%
  sdci: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdu: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sddp: ios=198/312074, merge=0/0, ticks=127/1766045, in_queue=1765142, util=93.88%
    dm-23: ios=360/482605, merge=0/0, ticks=249/3552885, in_queue=3553191, util=99.45%, aggrios=100/120654, aggrmerge=0/0, aggrticks=65/886969, aggrin_queue=886586, aggrutil=93.97%
  sddq: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdbc: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcj: ios=200/241309, merge=0/0, ticks=131/1767290, in_queue=1766536, util=93.97%
  sdv: ios=200/241310, merge=0/0, ticks=129/1780588, in_queue=1779810, util=93.97%
    dm-24: ios=330/482473, merge=0/0, ticks=217/3552483, in_queue=3552709, util=99.47%, aggrios=92/120621, aggrmerge=0/0, aggrticks=51/886814, aggrin_queue=886438, aggrutil=93.97%
  sdbk: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcr: ios=184/241244, merge=0/0, ticks=114/1767747, in_queue=1766993, util=93.97%
  sddy: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdad: ios=186/241241, merge=0/0, ticks=93/1779509, in_queue=1778759, util=93.97%
    dm-25: ios=360/482231, merge=0/0, ticks=256/3552582, in_queue=3552887, util=99.47%, aggrios=100/120562, aggrmerge=0/0, aggrticks=71/886822, aggrin_queue=886468, aggrutil=94.00%
  sdab: ios=201/241123, merge=0/0, ticks=137/1778748, in_queue=1778065, util=93.98%
  sdbi: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcp: ios=199/241125, merge=0/0, ticks=150/1768541, in_queue=1767808, util=94.00%
  sddw: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
    dm-26: ios=480/624999, merge=0/0, ticks=263/3548763, in_queue=3549043, util=99.47%, aggrios=140/156253, aggrmerge=0/0, aggrticks=71/885527, aggrin_queue=885044, aggrutil=93.93%
  sdcq: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sddx: ios=279/312507, merge=0/0, ticks=134/1766388, in_queue=1765379, util=93.90%
  sdac: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdbj: ios=281/312506, merge=0/0, ticks=151/1775723, in_queue=1774800, util=93.93%
    dm-27: ios=520/625535, merge=0/0, ticks=245/3548580, in_queue=3548799, util=99.49%, aggrios=140/156387, aggrmerge=0/0, aggrticks=64/885479, aggrin_queue=884979, aggrutil=93.93%
  sddv: ios=279/312775, merge=0/0, ticks=128/1765560, in_queue=1764579, util=93.90%
  sdaa: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdbh: ios=281/312774, merge=0/0, ticks=128/1776356, in_queue=1775340, util=93.93%
  sdco: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%